#+TITLE: about emacs org-mode softly

* TODO date, insert

- C-c .
- C-c ! : inactive time
- <2003-09-16 Tue>
- <2003-09-16 Tue 09:39>
- <2003-09-16 Tue 12:00-12:30>
- org-display-custom-times
- org-time-stamp-custom-formats
- <2022-03-02 ¼ö> 
- %a

#+BEGIN_SRC 
%a is the locale’s abbreviated name of the day of week, %A the full name.
#+END_SRC

- M-x describe-variable RET org-time-stamp-custom-formats

#+BEGIN_SRC 
org-time-stamp-custom-formats is a variable defined in ‘org.el’.
Its value is ("<%m/%d/%y %a>" . "<%m/%d/%y %a %H:%M>")

Documentation:
Custom formats for time stamps.  See ‘format-time-string’ for the syntax.
These are overlaid over the default ISO format if the variable
‘org-display-custom-times’ is set.  Time like %H:%M should be at the
end of the second format.  The custom formats are also honored by export
commands, if custom time display is turned on at the time of export.

You can customize this variable.
#+END_SRC

#+BEGIN_SRC 
(custom-set-variables
 ;; ...
 '(org-time-stamp-custom-formats (quote ("<%d/%m/%Y %a>" . "<%d %m %Y  %a [%H:%M]>"))))
#+END_SRC

* TODO indent

;; https://orgmode.org/manual/Hard-indentation.html
(setq org-adapt-indentation nil
      org-hide-leading-stars nil
      org-odd-levels-only nil)

* TODO with source

** DONE '<s' not working

https://orgmode.org/manual/Structure-Templates.html
(require 'org-tempo)

** TODO python

#+begin_src python
  print('hi')

#+end_src

* font

** win

여런 emacs 사용자들의 글에서 가져왔다. 어느 분인지 기억하지 못하지만 코드는 남는다.

#+BEGIN_SRC 
(face-attribute 'default :font)
(set-frame-font "나눔고딕코딩-14:normal" t t)
C-x C-=
C-x C--
#+END_SRC

** mac os x

#+BEGIN_SRC 
(when (eq system-type 'darwin)
  (set-face-attribute 'default nil :family "Monaco")
  (set-face-attribute 'default nil :height 130)
  (set-fontset-font t 'hangul (font-spec :name "NanumGothicCoding"))
  )

(setq face-font-rescale-alist
      '((".*hiragino.*" . 1.2)
        ("NanumGothic" . 1.2307692307692308)))
#+END_SRC

* read words about it

- http://orgmode.org/worg/org-quotes.html

* command

- C-c C-e b : export to html file then open it from browser
- C-c a : type command for agenda view

* calc or spreadsheet

#+BEGIN_SRC 
(setq org-html-table-default-attributes
      '(:border "2" :cellspacing "0" :cellpadding "6" :rules "all" :frame "border"))
;;      '(:border "2" :cellspacing "0" :cellpadding "6" :rules "none" :frame "none"))
#+END_SRC

#+BEGIN_SRC 
#+ATTR_HTML: :border 2 :rules all :frame border
#+END_SRC

| x | y | z | sum using vsum |
|---+---+---+----------------|
| 1 | 1 | 1 |              3 |
| 2 | 2 | 2 |              6 |
| 3 | 3 | 3 |              9 |
|---+---+---+----------------|
| 0 | 0 | 0 |              6 |
#+TBLFM: $4=vsum($1..$3)::@5$4=vsum(@2$2..@4$2)

** detail

- C-c ?
- C-c }
- = : field
- := : column totally 
- $2 : column
- @3 : row
- @3$2
- vmean, vcount, vsum, vmax
- C-c ' : new buffer
- C-c { : debug

** link

- C-c C-l : create link
- C-c C-o : open link

[[shell:ls%20-ltr%20|%20grep%20foo][this is the date]]  execute shell script in here
[[file:wiki.org][wiki]] simply
[[elisp:(princ%20(%2B%203%203))][sum]] can run lisp code on it, elisp

* is the future of the text format?!

* tag

** this is the more							:tag:
** and more							   :love:tag:
** some of							       :love:
